#Напишите программу, которая принимает на вход число и выводит его квадратный корень.
def koren(ss):
    return ss * ss

chislo = int(input("Vvedite chislo: "))
otvet =  koren(chislo)
print(otvet)

